In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:easwari@localhost

In [3]:
%%sql
use window_functions;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [4]:
%%sql
select * from employees4;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[(1, 'Alice', None),
 (2, 'Bob', 1),
 (3, 'Carol', 1),
 (4, 'David', 2),
 (5, 'Eve', 2),
 (6, 'Frank', 3),
 (7, 'Grace', 4)]

In [5]:
%%sql
select emp_id,name from employees4
where emp_id in(select distinct(manager_id) from employees4);

 * mysql+pymysql://root:***@localhost
4 rows affected.

[(1, 'Alice'), (2, 'Bob'), (3, 'Carol'), (4, 'David')]

--> display the employees hierarchy

In [7]:
%%sql
with recursive emp_hierarchy as
(
select name as emp_name, emp_id,name as manager_name,emp_id as manager_id, 1 as level from employees4
where emp_id in(select distinct(manager_id) from employees4 where manager_id is not null)

union all

select e.name as `emp_name`,e.emp_id,eh.manager_name,e.manager_id, level+1 as level
from emp_hierarchy as eh inner join employees4 as e
on eh.emp_id = e.manager_id
)
select * from emp_hierarchy;

 * mysql+pymysql://root:***@localhost
15 rows affected.

[('Alice', 1, 'Alice', 1, 1),
 ('Bob', 2, 'Bob', 2, 1),
 ('Carol', 3, 'Carol', 3, 1),
 ('David', 4, 'David', 4, 1),
 ('Bob', 2, 'Alice', 1, 2),
 ('Carol', 3, 'Alice', 1, 2),
 ('David', 4, 'Bob', 2, 2),
 ('Eve', 5, 'Bob', 2, 2),
 ('Frank', 6, 'Carol', 3, 2),
 ('Grace', 7, 'David', 4, 2),
 ('David', 4, 'Alice', 2, 3),
 ('Eve', 5, 'Alice', 2, 3),
 ('Frank', 6, 'Alice', 3, 3),
 ('Grace', 7, 'Bob', 4, 3),
 ('Grace', 7, 'Alice', 4, 4)]

In [58]:
%%sql
with recursive emp_hierarchy as
(
select name as emp_name, emp_id,name as manager_name,emp_id as manager_id, 1 as level from employees4
where emp_id in(select distinct(manager_id) from employees4 where manager_id is not null)

union all

select e.name as `emp_name`,e.emp_id,eh.manager_name,e.manager_id, level+1 as level
from emp_hierarchy as eh inner join employees4 as e
on eh.emp_id = e.manager_id
)
select * from emp_hierarchy
where emp_id <> manager_id;

 * mysql+pymysql://root:***@localhost
11 rows affected.

[('Bob', 2, 'Alice', 1, 2),
 ('Carol', 3, 'Alice', 1, 2),
 ('David', 4, 'Bob', 2, 2),
 ('Eve', 5, 'Bob', 2, 2),
 ('Frank', 6, 'Carol', 3, 2),
 ('Grace', 7, 'David', 4, 2),
 ('David', 4, 'Alice', 2, 3),
 ('Eve', 5, 'Alice', 2, 3),
 ('Frank', 6, 'Alice', 3, 3),
 ('Grace', 7, 'Bob', 4, 3),
 ('Grace', 7, 'Alice', 4, 4)]

--> find all direct and indirect reports under manager --> {alice}

In [55]:
%%sql
with recursive emp_hierarchy as
(
select name as emp_name, emp_id,name as manager_name,emp_id as manager_id, 1 as level from employees4
where emp_id in(select distinct(manager_id) from employees4 where manager_id is not null)

union all

select e.name as `emp_name`,e.emp_id,eh.manager_name,e.manager_id, level+1 as level
from emp_hierarchy as eh inner join employees4 as e
on eh.emp_id = e.manager_id
)
select * from emp_hierarchy
where emp_id <> manager_id
and manager_name = 'Alice';

 * mysql+pymysql://root:***@localhost
6 rows affected.

[('Bob', 2, 'Alice', 1, 2),
 ('Carol', 3, 'Alice', 1, 2),
 ('David', 4, 'Alice', 2, 3),
 ('Eve', 5, 'Alice', 2, 3),
 ('Frank', 6, 'Alice', 3, 3),
 ('Grace', 7, 'Alice', 4, 4)]

--> find the direct and indirect reports of each manager

In [49]:
%%sql
with recursive emp_hierarchy as(
select name as emp_name, emp_id,name as manager_name,emp_id as manager_id, 1 as level from employees4
where emp_id in(
select distinct(manager_id) from employees4 where manager_id is not null)
union all
select e.name as `emp_name`,e.emp_id,eh.manager_name,e.manager_id, level+1 as level
from emp_hierarchy as eh inner join employees4 as e
on eh.emp_id = e.manager_id
)
select manager_name, count(emp_id) as `direct and indirect reports`
from emp_hierarchy
where emp_id <> manager_id
group by manager_name;

 * mysql+pymysql://root:***@localhost
4 rows affected.

[('Alice', 6), ('Bob', 3), ('Carol', 1), ('David', 1)]

--> find the only the direct-reports of each manager

In [50]:
%%sql
select e.*,m.*
from (employees4 as e) inner join (employees4 as m)
on e.manager_id = m.emp_id;

 * mysql+pymysql://root:***@localhost
6 rows affected.

[(2, 'Bob', 1, 1, 'Alice', None),
 (3, 'Carol', 1, 1, 'Alice', None),
 (4, 'David', 2, 2, 'Bob', 1),
 (5, 'Eve', 2, 2, 'Bob', 1),
 (6, 'Frank', 3, 3, 'Carol', 1),
 (7, 'Grace', 4, 4, 'David', 2)]

In [60]:
%%sql
select m.emp_id as `manager_id`,m.name as `manager_name`, count(e.emp_id) as `direct_reports`
from (employees4 as e) inner join (employees4 as m)
on e.manager_id = m.emp_id
group by `manager_id`,`manager_name`;

 * mysql+pymysql://root:***@localhost
4 rows affected.

[(1, 'Alice', 2), (2, 'Bob', 2), (3, 'Carol', 1), (4, 'David', 1)]

## ----------------------------------------------------------------------------------------------------------------